#인공지능은 사고방식이나 학습등 인간이 가지는 지적능엵을 컴퓨터를 통해 구현하는 기술 
# 머신러닝 컴퓨가 스스로 학습하여 인공지능의 성능을 향상 시키는 기술 
#- 머신러닝은 동작을 데이터로 학습하여 스스로 패턴을 찾아 작업을 실행할 수 있도록 데이터를 분석하고 스스로 학습한 후 그속에서 패턴 및 규칙성을 찾는 기술입니다. 

# 딥러닝 인간의 뉴런과 비슷한 인공신경망 방식으로 정보를 처리 

#https://blog.naver.com/mildrose/222423809548
# 최근접이웃 분류분석모델 (유사속성에 따라 분류 )
# 기존관측치 y값 클래스가 존재함 (비지도 학습 클러스터링과 다름)
# 데이터로부터 거리가 가까운 k개의 다른데이터의 레이블을 참조하여 분류함
# 거리측정 유클리디안 거리 계산법 사용 예를 들면 이미지 처리, 영상에서 글자 및 얼술인식, 영화 음악 
# 상품 추천에 대한 개인선호 예측, 의료 유전자데이터 패턴 인식 
for i in range(1, 11):
    print(i)
    print("안녕하세요")